indians
united_states
would
may
shall
said
nation
treaty
one
made
us
time
part
upon
chiefs
people
country
commissioners
war
indian
states
state
present
government
river
lands
also
two
land
great
place
must
received
make
peace
georgia
could
agent
general
give
letter
president
well
creeks
much
men
first
every
order
sent
given
number
without
day
might
therefore
good
tribes
congress
done
cherokees
council
say
necessary
many
amount
creek
whole
president_united
wish
know
among
information
informed
come
line
hope
take
taken
go
business
answer
goods
see
governor
sir
year
party
power
three
purpose
nations
yet
proper
last
brothers
since
towns
march
soon
several
act
way
trade
however
far
opinion
right
within
found
talk
killed
near
little
return
warriors
account
secretary_war
man
receive
never
manner
territory
honor
creek_nation
town
case
left
paid
told
dollars
others
called
pay
lie
conduct
long
friends
send
persons
meet
public
immediately
object
point
chief
father
children
june
mentioned
came
parties
think
certain
treaties
delivered
instructions
request
means
considered
july
property
course
sum
together
white_people
instant
believe
heard
find
either
claim
british
house
nothing
captain
report
troops
directed
ought
friendly
whether
arrived
art
making
another
protection
best
effect
excellency
john
always
authority
white
prevent
following
small
inform
horses
hand
department
talks
consideration
new
settlements
appointed
october
late
articles
remain
militia
doubt
orders
law
provisions
one_hundred
even
agents
still
ever
one_thousand
indian_affairs
although
april
four
tribe
justice
aforesaid
towards
office
cause
frontiers
circumstances
mississippi
view
consequence
citizens
colonel
old
september
interest
determined
mouth
attend
settled
august
brother
friendship
thereof
presents
brought
meeting
person
proposed
intended
duty
fort
held
head
interpreter
appears
returned
committee
company
expected
already
want
large
agreed
situation
hear
possible
cherokee
force
appear
going
furnished
desire
claims
particularly
except
boundary
expense
november
measure
cession
road
true
thing
chiefs_warriors
particular
terms
generally
live
former
six_nations
december
consider
ohio
settlement
indian_tribes
provided
full
thence
missouri
continue
leave
stated
measures
copy
january
put
whose
quarter
ol
state_georgia
expect
money
regard
hands
letters
post
purchase
side
gave
tennessee
bad
express
sufficient
cherokee_nation
become
army
like
least
known
secretary
seen
established
better
influence
required
father_president
ordered
obtain
communication
due
probably
service
officers
reason
question
character
occasion
speak
requested
water
thus
future
unless
less
establishment
ot
authorized
major
bring
general_government
six
passed
frontier
article
met
five
let
choctaws
result
respect
west
days
county
took
went
keep
inhabitants
miles
nature
set
able
matter
sold
new_york
friend
fully
perhaps
attention
objects
different
important
war_department
traders
chickasaws
james
next
satisfaction
yesterday
obtained
believed
possession
signed
things
get
matters
detroit
relation
furnish
south
within_limits
name
ground
granted
remove
america
statement
governor_blount
forwarded
philadelphia
affairs
district
support
officer
whites
morning
enclosed
back
direct
attended
limits
agency
favor
disposition
tell
major_general
hold
employed
require
form
written
confidence
relative
respecting
strong
period
deliver
promised
every_thing
fact
though
arrival
gone
annuity
month
proceed
thought
understood
rights
call
william
aid
high
laws
factory
ceded
superintendent
speech
lately
whatever
village
latter
plan
treat
removal
views
wishes
system
concluded
accordingly
none
accounts
command
mark
king
rivers
louis
date
kind
expenses
considerable
join
laid
agree
rations
entirely
necessity
committed
senate
negotiation
engaged
years
carried
arkansas
february
distance
allowed
north
removed
principal
indian_trade
enemy
life
said_tribe
consent
open
knowledge
according
dated
expedition
grant
happy
prisoners
services
waters
loss
formed
cumberland
carry
advice
two_hundred
end
truth
parts
washington
besides
disposed
asked
demand
tract
executive
gentlemen
coming
supplies
continued
till
giving
horse
family
ask
wabash
individuals
condition
cents
lay
second
miami
red
payment
entered
spaniards
j
appeared
marked
saw
price
opportunity
visit
referred
superintendent_indian
nearly
contrary
run
direction
intention
places
supposed
extract_letter
indian_agent
home
session
reply
families
evidence
viz
ready
trust
safety
quantity
forward
render
arms
taking
lost
show
addressed
value
otherwise
boundary_line
observed
survey
copy_letter
expressed
arrangement
hostile
mcintosh
message
reasons
title
eight_hundred
neither
hunting
union
proceedings
papers
body
paper
seems
americans
e
compensation
along
addition
hostilities
settle
general_gaines
supply
square
heretofore
offer
provision
citizens_united
says
desired
lieutenant
military
society
mind
intercourse
words
red_river
execution
indeed
night
instructed
florida
reasonable
got
understand
choctaw_nation
attempt
indian_department
minds
feel
pensacola
ten
lower_towns
ultimo
die
lake
probable
benefit
enable
accompany
yon
corn
moment
half
secure
policy
immediate
eight
kept
pleasure
boundaries
equal
garrison
additional
difficulties
numbers
afford
observe
enemies
longer
danger
fall
desirous
read
interests
placed
assembled
certainly
pass
mcgillivray
mischief
annuities
five_hundred
importance
offered
sentiments
likewise
behalf
difficulty
presence
southern
event
portion
friends_brothers
away
defence
transmitted
legislature
determination
commissioner
per
soil
guard
mode
east
security
fear
wished
camp
agreeably
three_hundred
general_washington
hostile_indians
fixed
promise
presented
past
pleased
assured
purposes
accompanied
notice
happiness
evening
mary
address
acres
including
adopted
sell
purchased
suppose
whilst
twenty
permitted
permit
care
idea
hereby
extend
posts
consequences
common
previous
charged
beginning
white_man
sale
willing
murder
wounded
names
used
shawanese
establish
assistance
arrangements
belonging
write
civilization
add
please
similar
spring
commission
notwithstanding
testimony
w
delawares
contract
honorable
brigadier_general
son
endeavor
wyandots
reside
factories
proceeded
communicated
look
spirit
satisfied
chickasaw
city
destroyed
prepared
work
private
free
obedient_servant
take_place
beyond
communications
induced
conference
listen
contained
department_war
change
enough
early
forever
times
oconee
advance
application
appointment
points
fifty
osage
acts
operation
mean
success
joseph
upper
equally
submitted
stipulated
degree
cases
bound
houses
communicate
sir_department
almost
applied
raised
suffer
poor
judge
charge
blood
favorable
white_men
wrote
branch
anil
short
reported
attack
causes
satisfactory
rest
spanish
appropriation
choctaw
esq
b
impossible
kill
extent
advantages
upper_creeks
peace_friendship
treasury
protect
kentucky
propose
possess
lines
william_clark
united
induce
explained
villages
great_spirit
experience
representatives
hopes
destroy
osages
assure
actually
young_men
injury
merchandise
refused
respectfully
conversation
thomas
two_thousand
principles
treated
respective
french
governor_georgia
greatly
sandusky
beg_leave
fair
rendered
estimate
knew
station
delay
duties
amongst
sioux
various
close
remaining
north_carolina
chiefs_headmen
ami
compelled
exchange
extended
indian_nations
light
american
seven
examination
stock
produce
heads
commanding_officer
reservation
reports
prevented
reservations
arc
greatest
advised
lead
propriety
savages
desirable
resolved
clear
confirmed
lower
valuable
lor
rock_landing
neighborhood
ago
convenient
alabama
improvements
complete
boats
pennsylvania
connected
seem
seven_hundred
pattawatamies
twelve
discovered
treaty_held
lives
procure
women_children
national
language
mission
bowles
arrive
skins
contemplated
proportion
intentions
frequently
issued
rather
mention
effected
especially
young
opposition
estimated
declared
acquainted
transportation
cussetahs
deputation
witness
safe
senecas
convention
third
annually
virginia
agreeable
conceive
writing
described
produced
great_respect
secured
answered
fur
suitable
interpreters
judgment
sides
exertions
western
hunt
replied
death
leaving
drawn
store
miamies
lias
ascertain
savannah
running
correspondence
smith
new_orleans
advantage
invited
daily
finding
often
path
copies
foregoing
james_seagrove
operations
watts
thereby
clothing
york
afterwards
lived
hereafter
deponent
greater
documents
appoint
facts
joined
acquired
obliged
cattle
late_war
hoped
gentleman
pursued
pittsburg
claimed
whereas
whenever
powers
journey
refer
indian_springs
seagrove
commence
named
acting
george
residence
companies
fort_washington
x_mark
control
receiving
individual
living
decision
population
appearance
chickasaw_nation
submit
west_mississippi
women
regulations
front
heart
assist
persuaded
useful
usual
move
fort_wayne
expedient
feelings
told_us
reference
learn
niagara
fire
resolution
permanent
enter
principal_chiefs
herewith
extending
wants
numerous
fork
nashville
follows
presume
house_representatives
season
six_hundred
occupied
inquiry
depredations
red_people
reserved
may_think
received_letter
savage
balance
serve
collected
admit
commenced
explain
correct
board
colonel_hawkins
principally
servant
considerations
negotiations
entitled
progress
stipulations
tennessee_river
regular
wanted
one_section
directions
northern
trader
transmit
alone
proposition
presumed
acted
ascertained
humanity
containing
real
passing
principle
contractor
thousand_dollars
destruction
big
highly
l
exist
panton
efforts
reached
great_britain
campaign
levies
last_year
person_persons
approved
entire
augusta
prove
great_father
counties
previously
settlers
capital
actual
regret
liberty
dollars_per
remark
added
distant
issue
south_carolina
conducted
fell
acknowledge
executed
remarks
nine
intelligence
convinced
relations
included
black
advanced
remains
instead
original
one_mile
chicago
invitation
excellency_governor
circumstance
exposed
stand
engage
murdered
sending
thereto
murderers
f
state_new
altogether
represented
dead
route
belief
provide
delaware
late_treaty
single
anxious
r
extensive
tract_land
detachment
thirty
opened
cost
apply
cash
owing
kickapoos
follow
governor_troup
punish
constitution
hut
ii
hunting_grounds
practicable
commissioners_appointed
lake_erie
strength
credit
recommend
lies
receipt
suffered
instance
general_jackson
lying
lewis_cass
description
urged
woods
hawkins
shortly
difficult
raise
neighbors
salt
bank
hence
something
determine
increase
pounds
fifteen
absence
subsistence
trouble
coweta
reduced
perfectly
cut
cornplanter
essential
stores
negroes
proof
serious
remained
recently
four_hundred
illinois
repeated
avoid
quiet
schools
creeks_cherokees
hostility
hitherto
seemed
prices
privates
boat
vicinity
turn
bands
difference
calculated
thought_proper
georgetown
bringing
bear
blankets
winter
mountain
suggested
ammunition
buffalo
chippewas
include
independent
exercise
lakes
forty
compact
tu
gun
separate
island
agreement
supplied
buffalo_creek
mine
factor
residing
perfect
pointed
felt
pursue
foot
respectively
requires
treaty_concluded
prairie_du
benjamin_hawkins
fail
led
woman
concerned
game
english
spoke
concerning
subjects
extract
appropriated
limited
annual
assigned
acknowledged
upper_towns
mean_time
warrior
intend
salary
stop
advise
disbursements
chien
action
stay
conclude
properly
preserve
utmost
hath
draw
consequently
advice_consent
enclose
happened
months
low
knowing
shot
honor_sir
word
furs_peltries
therein
wit
belong
mountains
c
evil
liberal
peaceable
summer
characters
sorry
spot
sums
amounting
special
total
unfortunate
occupy
representation
sixty
perceive
prophet
permission
conceived
hearts
oakmulgee
declare
followed
adjoining
respectable
christian_indians
completed
commanding
creek_agency
improvement
vincennes
opposed
instrument
fort_pitt
founded
source
strongly
habits
discover
examined
education
ratification
preceding
readily
holding
attached
motives
obtaining
w_ill
barnard
employ
formerly
sensible
hundred
cessions
afforded
statements
buildings
brown
henry
strike
guns
round
effects
ns
need
official
map
answers
brethren
reserve
situated
beyond_mississippi
objection
opposite
without_delay
communicated_senate
short_time
spain
exceed
corps
love
repair
war_office
delegation
north_side
testimony_whereof
year_lord
sometimes
approbation
unnecessary
make_peace
bought
discretion
florida_indians
thereon
accommodation
increased
allow
existing
demanded
conclusion
hill
afraid
six_miles
carrying
extinguished
lewis
oath
powder
returning
practice
shown
admitted
propositions
think_proper
recommended
length
reach
expenditures
marched
conditions
lower_creeks
commanded
states_america
attempted
demands
gives
promises
occasions
interference
active
relief
deemed
exceeding
hunters
save
indispensable
refuse
political
let_us
sundry
fine
charges
respects
establishing
councils
killing
continuance
commencement
w_hich
witnesses
field
returns
caused
events
v
wait
rich
muskingum
performed
prospect
school
roads
decided
term
three_thousand
surrender
flint_river
broken_arrow
thirteen
declaration
compliance
expectation
division
proposals
powerful
glass
prairie
letter_instant
accept
informing
relating
elder_brother
unable
david
battalion
enabled
possessed
reason_believe
highest
expended
may_require
tract_country
samuel
abstract
labor
measures_taken
natchitoches
became
trading
speaker
enjoy
yards
innocent
complaints
constantly
finally
soon_possible
voice
world
glad
endeavored
beloved_men
tuckaubatchee
civilized
comply
hearing
conformity
assurances
easy
sure
seeing
sanction
well_known
attending
obligation
note
lbs
tor
makes
harrison
adopt
lands_within
easily
middle
great_chief
sooner
funds
divided
sufficiently
th
departure
senate_united
mobile
satisfy
consisting
merely
runners
crossed
privilege
section
bearer
removing
clair
upwards
northwest
contain
covered
exclusive
colonel_crowell
keeping
infantry
market
turned
passage
represent
across
hold_treaty
members
seneca_nation
complied
delivery
louisiana
ans
subsequent
establishments
certificate
honor_enclose
south_side
thousand
vested
among_us
temporary
fathers
opinions
connexion
threatened
excepting
per_annum
improper
articles_treaty
cavalry
river_thence
agreed_upon
concern
occasioned
position
west_side
little_turkey
line_run
adequate
proved
clock
factors
accomplished
appropriations
lands_ceded
dear_sir
repeat
arising
western_indians
visited
emigrants
butler
remember
prepare
directly
choose
auguste_chouteau
quality
fairly
tribe_indians
citizen
leading
andrew_jackson
obligations
collect
seneca
personal
foreign
contains
execute
pursuance
oil
understanding
headmen
earth
arms_ammunition
meaning
designated
located
near_mouth
wisdom
honor_obedient
attacked
missionaries
depend
peter
duly
signed_also
made_concluded
hard
particulars
interesting
broken
forming
punished
transactions
embrace
hour
instruction
interested
contracting_parties
convince
deputies
complain
sixteen
bill
stating
around
anti
regiment
commerce
remainder
sales
tlie
wife
dispositions
springs
liable
list
explanation
banks
journal
allowance
frequent
seminoles
eighteen
natural
stopped
assent
saying
sir_obedient
general_mcintosh
big_warrior
assistant
green_bay
extremely
justify
districts
endeavors
general_robertson
weight
observation
existence
ratified
faith
recent
oft
thomas_mckenney
quartermaster
artillery
fix
prosperity
running_line
invoice
friend_brother
recollect
relinquish
eyes
extension
clerk
ditto
fired
getting
sincere
confirm
deep
speaking
standing
scarcely
restored
information_received
red_children
bad_men
sincerity
furs
conveyance
interfere
council_fire
punishment
complaint
charles
georgians
solemn
faithful
cowetas
observations
accompanying
trees
certainty
tree
east_side
whiskey
peltries
pursuit
confined
fellow
next_day
higher
eighty
moved
two_days
two_miles
grounds
timber
pair
take_care
informs
news
strictly
rate
opening
interpreted
tobacco
considering
help
despatch
civil
great_little
deed
speeches
carolina
u
assemble
holston
northward
bounds
lest
bayou
wise
cease
tne
letter_secretary
sign
sworn
hon
guilty
alexander
act_congress
john_mckee
cross
prior
beg
requisition
washington_city
many_years
majority
believing
truly
procured
selected
objections
check
rifles
amount_merchandise
waiting
wide
memorial
tomahawk
competent
ratification_treaty
despatched
w_ith
hanging_maw
affair
alter
calling
supported
ridge
issues
assurance
sun
robert
zeal
promote
consist
grants
inquire
campbell
ration
nevertheless
pray
mckenney
feet
mcdonald
likely
lose
comes
invite
discharged
surrounded
knoxville
requesting
cover
perform
existed
georgetown_georgetown
treating
general_clair
begin
governor_cass
humble_servant
mistake
approach
distinctly
erected
quite
benefits
consult
hereunto_set
transaction
amount_property
succeed
ill
threats
indian_title
ques
court
boy
crossing
augustine
thank
bay
paying
farther
abandoned
expectations
settling
distress
complained
manifested
requisite
handed
bloody_fellow
cultivation
undersigned_chiefs
made_known
began
inquiries
accepted
engagements
mail
first_day
military_force
territories
detail
perpetual
stipulate
prisoner
harmony
quarters
experienced
deceived
driven
gain
tampa_bay
five_thousand
falls
doctor
belonged
capable
westward
resided
faithfully
holding_treaty
eleven
three_miles
firm
three_four
stipulation
let_know
runner
investigation
wm
general_mcgillivray
general_chapin
commandant
construction
taken_place
design
raising
take_measures
wyandot
main
equivalent
positive
justly
history
worthy
freely
share
authorize
excited
chickasaws_choctaws
oppose
richard
color
rock
successful
worth
examine
like_manner
battle
general_assembly
trial
ample
thence_along
fund
entering
impression
conviction
fourth
protected
cultivate
proceeding
bis
built
rank
natchez
owners
mutual
canada
herein
five_nations
kindness
defeat
distribution
northwest_ohio
occurred
derived
phelps
apprehend
h
young_warriors
belt
apprehended
try
losses
attempts
decline
spoken
employment
fallen
alarm
laws_united
authorities
urge
dispose
virtue
last_session
god
communicated_house
present_year
june_sir
murders
john_watts
per_cent
general_pickens
specified
effectual
vessel
conveyed
increasing
avoided
choice
convenience
arise
attachment
prompt
whence
contingencies
state_things
obvious
beaver
immense
petition
disagreeable
little_prince
wood
george_graham
francis
mckee
effectually
administration
ihe
stolen
knox_secretary
unite
surveyed
regular_troops
one_another
useless
range
de
encampment
grand
rise
break
esteem
happen
endeavoring
two_years
wrong
last_winter
published
feeling
advantageous
involved
succeeded
honor_transmit
thence_said
arid
abandon
location
accomplish
alluded
interview
negro
views_government
ten_thousand
general_wayne
fulfilment
clearly
michilimackinac
embraced
distinguished
natives
brandt
state_tennessee
captain_brandt
mere
differences
iny
river_ohio
cornell
commit
seal_mark
invasion
plain
detained
sovereignty
silver
recognised
personally
jurisdiction
british_traders
exclusively
wilson
humane
convey
necessarily
souls
proclamation
presqu_isle
ideas
state_north
letter_governor
restrain
minutes
moral
inclined
see_page
deer_skins
cede
enlightened
dangerous
nearest
commencing
approve
absent
encamped
relinquishment
discharge
exhibited
junction
scouts
violation
risk
younger_brothers
rule
messenger
bills
welfare
inconvenience
twelve_miles
long_time
evils
several_tribes
sort
undersigned
messages
trading_houses
superior
blacksmith
soldiers
strict
race
steps
g
last_month
east_mississippi
plans
entertain
enclosed_copy
timothy_barnard
troup
maintain
exception
honor_respectfully
part_behalf
chouteau
jackson
hills
twenty_miles
debts_due
probability
failure
four_miles
protest
legal
affords
instances
injuries
native
fields
ignorant
maybe
stationed
example
washita
despatches
apprehensions
cotton
plundered
iron
fourteen
agriculture
desires
fit
ninian_edwards
desist
usually
schedule
counsel
band
accounted
liberality
trace
cussetah
defend
blame
take_hand
providing
carry_effect
vain
act_making
arkansas_river
constant
sense
yield
resident
disputes
expressly
neighboring
pieces
calhoun
mills
declined
farms
bv
ordinary
blue
hundred_dollars
offenders
notified
sustained
different_tribes
trade_intercourse
license
march_march
chiefly
designs
child
drive
behalf_united
air
suggest
industry
lake_michigan
mile
canoes
greenville
ever_since
oneida
chippewa
within_territory
al
involve
seventeen
waited
letter_ultimo
heavy
carey
fidelity
side_mississippi
travelling
n
military_post
fort_fidius
final
pleasing
make_known
acquaint
put_death
denied
extreme
principal_chief
foundation
surprise
stood
encouraged
debt
sachems_chiefs
negotiate
three_days
questions
injurious
spare
respectfully_obedient
step
arm
messengers
warrant
retain
without_consent
deposited
saturday
composed
fears
relates
representations
shawanee
shawanees
great_deal
white_brothers
ensign
entertained
tbe
took_place
relatively
injustice
aware
kinnard
come_forward
resort
running_water
substance
independence_united
io
becomes
burnt
preserved
fast
nave
scalps
colonel_humphreys
ten_miles
shew
payments
sincerely
crowell
may_deem
good_faith
precise
wayne
possessions
meant
take_liberty
heirs
sugar
insult
appeal
injured
basis
creek_thence
economy
erie
knives
confident
fertile
would_appear
undoubtedly
wars
died
throughout
three_years
benjamin
garrisons
bed
proposed_treaty
stands
bargain
enacted
wholly
purchases
july_sir
cents_per
monday
thinks
furnishing
governed
duly_authorized
superintendent_office
dignity
preparing
expenditure
mad_dog
really
level
assumed
responsibility
colerain
treaty_ground
beloved
fort_hawkins
dozen
integrity
remote
hat
may_judge
supplying
arts
unknown
thrown
shaw
refusal
thompson
tire
reputation
encroachments
payable
white_red
article_treaty
delayed
leagues
attendance
sustain
treasury_department
christian
stone
salaries
dear
recollection
violence
unhappy
repeatedly
shall_ratified
taught
honor_acknowledge
proprietors
quantity_land
afternoon
quapaws
president_senate
distinction
moreover
countries
receipt_letter
deposition
state_ohio
community
rendezvous
beef
thirty_miles
branches
knows
esquire
prejudice
distributed
bluff
preserve_peace
contents
one_half
consulted
williams
debts
conferences
terminated
colonel_mckee
eel_river
council_adjourned
wild
commissioners_plenipotentiary
forty_miles
receipts
centre
cede_united
april_last
place_beginning
march_april
wc
johnston
unjust
pairs
greater_part
inferior
plenty
chaires
capacity
extraordinary
peculiar
consistent
regularly
side_river
fight
rejected
ones
purchasing
suspension
earnestly
special_agent
gradually
failed
forefathers
sin
well_acquainted
alarmed
ease
armed
marshall
temper
room
sight
outrage
robbed
gross
miller
would_seem
intelligent
surveyor
treaty_greenville
rely
selling
readiness
province
approaching
andrew_pickens
offence
manifest
disturbances
latitude
estimates
restore
operate
mr
apprehensive
allotted
possibly
certify
management
emigration
acquire
tend
principal_agent
remedy
first_article
johnson
guaranty
articles_agreement
surveys
direct_line
buy
cultivated
worse
occasionally
milledgeville
major_craig
southern_tribes
four_years
la
doubtless
decide
hail
finished
respected
sole
united_brethren
title_lands
navigation
prospects
hurt
captains
exhibit
expression
sick
excepted
ruin
w_e
cession_lands
district_country
enterprise
wampum
respectfully_submitted
submitted_president
western_boundary
wanting
independence
knox
gaines
fled
head_quarters
put_stop
domestic
cheerfully
canoe
kinds
unfriendly
good_work
advisable
becoming
per_day
comfort
forty_acres
hatchet
escort
honest
return_home
kaskaskia
listened
coleraine
passes
viewed
estanaula
agent_colonel
broke
fought
carried_effect
solemnly
health
department_milledgeville
tellico
marks
confederacy
exists
tools
land_ceded
annexed
state_missouri
tour
ottawas
proposal
learned
false
ears
preservation
fulfil
five_miles
current
inducement
proceeds
resolutions
mero_district
cloth
superintendents
lease
continuing
straight
crops
officers_privates
introduced
omitted
forget
yearly
movement
hon_john
depend_upon
compel
fate
exert
isle
jones
swamp
suspended
forms
flag
absolute
occupancy
travel
dispute
humphreys
hunter
impressions
fort_mitchell
apprehension
movements
thousand_acres
apparent
year_per
speedy
day_august
piece
injure
tranquillity
stream
state_pennsylvania
federal
tallahassee
contribute
seek
last_summer
prevail
books
flour
british_government
affording
results
fresh
eighteen_hundred
borders
axes
sacs_foxes
pound
lieutenant_colonel
st
southward
rangers
gratitude
happily
remarked
duplicate
spanish_government
advances
redress
requests
setting
secret
escaped
headmen_warriors
surveyors
cession_made
fort_erie
treaty_hopewell
colonel_butler
week
governor_clark
consented
one_piece
preference
colonel_john
prevailed
prescribed
neglect
tracts
reasonable_terms
eventually
daniel
upper_lower
instantly
territorial
servants
would_probably
place_called
partly
march_last
mandans
enforce
fifteen_hundred
throw
rapid
responsible
joining
detached
speedily
fort_franklin
enclose_copy
detailed
sought
rifle
acceptable
seal
present_situation
deer
severe
portage
completely
seventeen_fires
wishing
alive
compared
mackinac
privileges
young_man
confusion
mill
september_sir
suit
behind
flatter
offers
subscribed
regarded
ancient
contest
chain
renew
issuing
volunteers
ottawas_chippewas
illinois_river
requiring
exerted
undertake
bearing
money_goods
second_auditor
deliberate
run_line
declaring
thanks
efficient
posterity
convened
lands_lying
prosecution
book
surrendered
beloved_man
john_galphin
duly_sworn
agencies
exchange_lands
effecting
le
walker
citizens_georgia
edwards
bloody
relate
october_sir
rear
seat
violent
controversy
preparations
missionary
alteration
major_andrews
prophets
fish
seat_government
colonel_procter
leaves
plainly
touching
showing
resides
directing
assisted
treatment
carrying_effect
pecuniary
hon_calhoun
forts
benevolent
appalachicola
encourage
implements_husbandry
quantities
bounty
talked
directs
alleged
mistaken
horses_property
line_drawn
wilderness
moderate
anxiety
abundant
sacred
judges
oi
moneys
wyandots_delawares
mississippi_river
accustomed
eye
fifteen_miles
mitchell
designed
buried
effort
select
direction_president
robertson
partial
confided
build
borne
obstacles
extinguishment_indian
federal_troops
blount
relinquished
seals
restrained
sevier
hall
apparently
excuse
draft
jacob
inhabit
total_amount
countrymen
allies
hundred_twenty
accomplishment
micco
first_instance
goodness
growing
fifty_miles
shoes
tendency
judicious
amounts
geo
regulars
press
lawless
impracticable
chase
tried
govern
gentlemen_department
may_hereafter
scattered
sec
david_cornell
interior
combination
naked
general_clarke
miami_village
disappointed
federal_government
vast
tallassee
doubted
validity
bounded
closed
ferry
quit
uf
dry
adoption
legislature_state
renewed
orleans
titles
upon_terms
general_wilkinson
pursuing
violated
fort_harmar
attest
whatsoever
kaskaskias
tins
pretty
facilitate
years_ago
grievances
said_ridge
acres_land
superintendency
peaceably
graham
evident
distinct
per_abstract
conquered
thousand_eight
agreed_following
claim_lands
binding
joseph_mcminn
rising
consistently
w_ho
embracing
council_held
offensive
served
per_month
firmly
preventing
stationary
bottom
face
excellent
protection_frontiers
looked
beneficial
twenty_years
legislative
provision_made
sunday
abuse
allen
part_undersigned
purchase_lands
procuring
discussion
alleghany
lasting
american_citizens
green
enclosures
slaves
cumberland_river
uncertain
clerks
obedient_humble
sir_executive
general_knox
governor_clair
regulated
communicating
clark
chairman_committee
jealousy
commissioners_aforesaid
pattawatamie
inclination
cherokee_agency
derive
major_gaither
two_letters
six_thousand
tho
geo_washington
painful
proofs
hogs
enclosing
obedience
originally
material
retained
namely
search
suited
customs
michigan
emigrate
avail
plunder
exact
moving
executive_department
gained
grow
breaking
altamaha
rent
deputy
sachems
forced
resources
scott
piankeshaws
choctaws_chickasaws
enjoyed
severely
guarantied
exceedingly
spread
covering
governments
related
reflection
assembly
commissions
hardly
sit
take_satisfaction
commonwealth
hon_james
impressed
prudent
contracted
last_evening
chose
followers
acknowledgment
live_peace
stations
south_ohio
eastward
aided
species
commercial
april_june
empowered
footing
combined
bordering
kanzas
four_five
small_parties
early_possible
regulation
printed
duncan_campbell
confirmation
defined
vouchers
mississippi_territory
forage
speaks
works
spent
channel
white_lieutenant
surprised
southwest
tn
legion
merchants
june_last
profit
belongs
explicitly
age
dark
deficiency
inquired
friday
turkey
attempting
running_thence
ditto_ditto
applications
jefferson
amount_paid
suggestion
double
path_killer
deponent_saith
horses_stolen
food
countenance
repairing
rapids
termination
doubts
authorizing
files
create
paymaster
adams
practised
incurred
retaliation
shall_judge
local
sand
herewith_enclosed
page
acquisition
occur
unwilling
national_council
transport
second_article
clay
letter_addressed
habit
sacs
specific
murders_committed
accede
britain
teach
beads
sitting
mischief_done
experiment
pipe
horsemen
since_last
one_pair
changed
miami_river
last_fall
long_since
property_taken
plough
writes
aforesaid_three
using
maintained
fcc
accident
warm
spared
concerns
accurate
error
anticipated
wherever
hopewell
ana
contracts
door
necessaries
january_last
floridas
adhere
whole_number
bread
ability
conciliate
plains
destitute
kettles
fifteen_fires
struck
reliance
wabash_river
damage
port
instruct
next_morning
escape
ancestors
forks
occupation
tiie
revenge
defensive
tuesday
ford
pressed
third_day
securing
known_name
appearances
full_council
certified
accommodate
crosses
cold
profits
return_meigs
constitutional
extinguishment
warrants
reading
neglected
fort_stanwix
grass
illinois_territory
drink
general_logan
pine
abide
january_sir
deprived
reception
encouragement
city_washington
solid
governor_simcoe
post_vincennes
facilities
thursday
somewhat
ninety
distressed
extinguish
agree_pay
unto
colonel_gadsden
crimes
equitable
banditti
brave
republic
spoke_follows
fixing
pacific
killed_wounded
homes
liquor
look_upon
arrived_place
lieutenants
tell_us
realized
putting
document
deny
mounted_volunteers
lord_one
imposed
ceased
persuade
arisen
justified
preferred
materially
forbear
inserted
thereafter
bushels_corn
bodies
ten_years
committing
sum_appropriated
balance_due
examining
four_thousand
rejoice
deliberation
rain
adjusted
falling
colonel_pickering
unfavorable
coosa_river
honored
protecting
time_past
yellow_stone
ottawa_chippewa
towards_us
hair
intruders
influenced
one_dozen
six_months
notes
commonly_called
confluence
agreeably_treaty
fraud
margin
clarke
traffic
master
pain
general_sevier
twenty_thousand
northeast
top
day_september
dated_fort
width
surface
divide
variety
coining
site
superintendence
productive
vessels
well_disposed
facility
blessings
point_view
give_satisfaction
morris
daughter
know_whether
deem
glad_hear
great_pleasure
scalped
calculation
rose
favored
unprovoked
pledged
keep_peace
make_arrangements
class
motive
bones
institutions
prudence
hands_seals
several_letters
moon
white_inhabitants
landing
extracts
ten_days
indiana
meetings
absolutely
relieve
citizen_united
hambly
saith
december_sir
white_brethren
hours
excite
hy
instruments
affected
flat
clothes
depredations_committed
five_lower
august_sir
forth
extinction
details
eastern
michigan_territory
john_johnston
near_fort
des_moines
shore
extends
day_march
prefer
sat
lodged
dictated
factory_buildings
true_copy
comprehend
comfortable
twenty_poles
john_crowell
extinguish_indian
witness_whereof
following_report
adjacent
competition
limits_georgia
commands
dictate
franklin
sac_fox
arrest
major_seagrove
widow
publicly
set_apart
cloudy
expiration
alachua
drafts
carefully
inhabited
acre
entitled_act
pretend
reflect
tents
considerably
objects_mission
separated
sons
talk_delivered
rendering
governors
mad
dissatisfaction
suspicion
signing
forest
art_consideration
tenants
thence_south
looking
governor_duval
acquaintance
unanimously
premises
acting_governor
national_committee
devised
method
option
pretence
found_necessary
every_respect
start
place_places
superintendent_agent
justice_done
five_six
chickasaw_bluffs
drawing
tired
residue
pains
blacksmiths
pity
unfortunately
frontier_inhabitants
martin
fatal
legislature_georgia
frontiers_georgia
hamilton
gave_us
settle_matters
destined
expresses
annuities_per
execution_treaty
indians_residing
clothed
head_waters
bond
correspond
fellows
goes
public_service
lands_west
best_information
extra
objected
sell_lands
white_wampum
k
travellers
friendly_disposition
several_years
reserving
georgia_alabama
impress
enjoyment
altered
ascertaining
region
hunting_ground
adjust
dollars_cents
made_escape
abstracts
voluntary
wandering
surveying
apprized
separately
breadth
insisted
filled
contingent_expenses
alternative
retreat
congress_assembled
day_october
adjustment
occurrences
cession_land
senate_house
inviting
presenting
hostile_tribes
hesitate
since_writing
treaty_entered
amount_debits
april_sir
narrow
tracts_land
ignorance
arguments
totally
pledge
permanently
licenses
exertion
prairies
organized
right_title
outrages
sake
doings
captain_john
sum_five
conform
descendants
recommendation
depends
pay_subsistence
saved
islands
explicit
teachers
little_turtle
nights
tuckaubatchees
bold
acquiescence
may_rest
process
eat
baggage
conducting
concurrence
obey
dependence
ultimately
solely
per_statement
guide
justice_humanity
meriwether
deeply
postponed
mary_river
ou
thomas_hinds
thirteen_fires
meat
tenth
associates
randolph
ottawa
lowest
maw
ultimate
choctaw_children
wednesday
galphin
montgomery
offering
expensive
pride
new_town
william_henry
tin
laying
drew
alike
continually
merit
east_west
governor_telfair
nephew
exercised
gray
conquest
cent
otter
either_side
succeeding
subjected
crawford_secretary
nine_hundred
specie
conjunction
actions
united_slates
human
whereby
ail
obedient_servants
full_powers
headed
clinch
sum_paid
chief_magistrate
corner
seventy
fourth_article
inasmuch
delivering
sufferings
renders
absolutely_necessary
rev
member
uniform
may_stolen
winnebagoes
well_pleased
genesee
affect
millions_acres
delegates
patience
honor_inform
military_posts
table
england
chehaws
fox
pressing
contained_letter
performance
governor_mifflin
genera
saginaw
possessing
murdering
grown
generals
concur
doubtful
horrid
brigade
negotiated
adding
hot
venture
fortunate
williamson
ran
voluntarily
british_agents
days_ago
trail
enclosed_letter
forsyth
weather
fur_trade
nicholas
goshen
amicable
september_last
persons_property
several_days
ways
big_swamp
public_interest
defeated
hands_affixed
lot
mingo
verbal
crawford
conformably
unexpected
amounted
james_monroe
weas
shall_binding
enumerated
dragoons
wind
larger
person_appointed
prejudices
lands_belonging
henry_atkinson
come_see
uniformly
formal
calhoun_secretary
george_walton
convene
could_get
governor_harrison
barbour_secretary
james_barbour
february_last
reward
generous
evince
indian_debts
contend
bow
recollected
hats
insure
abundance
drove
declarations
disposal
land_lying
fort_osage
nut
inhabiting
inevitable
per_act
distressing
dare
french_broad
seriously
effect_object
essentially
kings
constrained
call_attention
watch
pork
tenor
created
base
suffering
ploughs
hasty
governor_western
officer_commanding
apalachy
items
warren_jourdan
whole_cherokee
last_mentioned
large_portion
consequent
positively
bethlehem
consisted
explanations
dispersed
vour
strongest
day_july
sections
coffee
asserted
killed_scalped
wall
attributed
terminate
arranged
crime
inspection
soldier
set_hands
appointed_president
repel
bind
arrange
thought_best
supposing
respectfully_sir
go_home
copy_herewith
northern_tribes
encounter
subsisting
sudden
parallel
confer
sentiment
amount_furs
depart
trying
hereby_agree
regulate_trade
old_line
confidential
ac
thence_direct
affidavit
addressing
sacrifice
days_since
northern_boundary
remnant
old_men
lower_cherokee
charleston
ensure
herewith_delivered
ensuing
ordinance
william_mcintosh
plantation
yard
unpleasant
memorialists
stealing_horses
red_brothers
shoulderbone
august_last
deducted
secondly
average
paragraph
vou
peltry
solicit
abilities
depending
wea
feared
amity
considerable_number
saving
believes
riflemen
one_dollar
nf
william_blount
collecting
head_chief
foot_rapids
preliminary
two_months
train
timothy_pickering
soon_practicable
square_miles
assembling
united_stales
benjamin_fallon
blow
state_alabama
arickaras
placing
helpless
stroke
every_person
pretended
oconee_river
fill
ocean
rents
strikes
statement_showing
desiring
partially
bend
cherokees_arkansas
toward
man_killed
beautiful
chattahoochie
consideration_respect
claimants
speaker_house
possibility
wyandot_delaware
destroying
sovereign
candid
france
spirits
diminution
hostages
guards
smaller
calls
richard_butler
young_people
sandy
recovery
allowing
two_companies
task
defray_expenses
deserve
incursions
different_nations
james_carey
western_country
designate
emigrant_indians
black_river
p
latter_part
economical
general_harrison
contractors
defensive_protection
complying
formation
behalf_said
talk_sent
county_lieutenants
merits
mass
report_secretary
still_continue
interrogatories
friendly_intercourse
possesses
hostile_party
ensue
handsome
organization
revenue
glad_see
territory_arkansas
treaty_holston
three_months
oak
oliver_phelps
exhausted
provides
cussetah_king
retire
deceive
hickory
king_great
claims_lands
indulged
recognise
caution
resorted
boundary_lines
large_party
council_bluffs
suspect
mounted
pleasant
stipulations_treaty
appropriate
space
shall_hereafter
tender
solicitude
payments_made
internal
boys
remembered
harmar
recited
uncertainty
suspend
transported
attentive
attorney
ottoes
general_armstrong
north_south
great_beloved
annum
large_body
mercy
weak
balls
james_wilkinson
abused
religion
streams
act_hostility
right_soil
leaders
red_brethren
white_population
states_territories
nay
resentment
sickness
ii_knox
cruel
erect
regretted
regulate
richmond
half_mile
former_treaties
eight_miles
valid
introduce
licensed
diminished
satisfactorily
commissary
shows
elsewhere
kings_chiefs
promptly
allison
asking
villains
commander
colors
january_march
inches
mahas
strangers
building
upon_occasion
argument
magnanimity
europe
travelled
talents
forbid
continues
thence_continued
colonel_campbell
saline
fifth
governor_neal
periods
turning
marked_thence
influential
withhold
general_clark
poles
kickapoo
angry
good_understanding
duck_river
civilized_life
principal_men
conversed
seven_nations
growth
put_end
mostly
battalions
given_hand
miami_lake
property_stolen
cornells
marked_b
assistant_agent
purport
scale
clause
rations_issued
indispensably_necessary
rejection
disturbed
canadian
fifty_dollars
subsistence_money
moderation
intersects
unsettled
servant_james
planted
act_march
departed
portions
paths
assuring
foreigners
runs
elder_brothers
notify
dollars_annually
strengthen
penalty
esteemed
indebted
prince
else
ins
dollar
remitted
sound
abraham
ratified_president
expenses_incurred
executive_state
refusing
sergeant
cane
retired
september_next
steal
shoals
never_heard
records
referring
upper_canada
custom
may_arise
attach
duval
good_talks
honorable_secretary
pursuant
feels
hold_intercourse
great_importance
william_duval
producing
hire
ridge_divides
rapidly
inclusive
territory_michigan
striking
private_traders
feed
major_ore
favorite
day_june
proportions
upper_parts
general_coffee
alexander_cornell
started
powder_lead
give_notice
wells
firing
may_depend
domestic_animals
men_women
shall_perpetual
defenceless
confidently
prohibited
burges
pounds_tobacco
must_necessarily
well_satisfied
universal
capt
loaded
eastern_boundary
fort_jackson
vengeance
alias
cattle_hogs
muscle_shoals
restrictions
quapaw
second_day
fault
waste
heretofore_made
industrious
weeks
two_sections
resembling
assume
reduce
participation
attacks
indemnity
attachment_united
assist_us
selection
forthwith
unworthy
good_effect
shall_reserved
beel
restoring
observing
withheld
thousands
poverty
honorable_body
murderer
superintend
token
simple
height
sincerely_hope
signature
benevolence
concession
rates
truce
invade
river_huron
constitute
would_permit
promoting
utter
spirituous_liquors
troublesome
negotiating
chairman
dance
comparison
degrees_east
preparation
threaten
content
oneidas
steal_horses
conveniently
march_date
landed
broad
day_april
completion
x
handkerchiefs
owe
losing
lying_within
november_last
red_jacket
canandaigua
perpetrators
transfer
warlike
captain_denny
coosa
repaired
joint
peaceful
reconcile
malden
friendship_protection
posted
correctly
rocky_mountains
fyc
hoped_would
four_days
hundreds
scene
intercourse_indian
impunity
april_april
embarrassment
revolution
crane
breath
excellency_william
earnest
pickens
tis
anthony
apprize
ended
subsist
eastwardly
judging
hiwassee
promising
expects
may_deemed
river_mary
taylor
chosen
stole
wagon
murder_committed
lands_claimed
record
commissioners_met
treaty_ratified
trader_hill
white_settlements
wolf
interposition
talking
concert
precarious
fully_explained
appearing
actuated
flow
rob
massachusetts
hereby_ceded
divisions
assert
barrels
hot_springs
honor_receive
piamingo
many_others
finnelson
uneasiness
loose
quartermaster_department
deemed_necessary
distinguish
evinced
without_loss
indulge
hoes
conveying
institution
great_body
tombigby
taste
acting_secretary
misunderstanding
minute
begun
petitioners
unauthorized
dread
therefrom
place_holding
accused
arrangement_made
paul
dearborn
returned_home
george_sibley
major_henry
creeks_communicated
adhered
denny
colbert
wilkinson
actually_engaged
labors
every_exertion
cannon
insist
singular
barter
interrupt
imposed_upon
discovery
number_horses
wagons
mercantile
house_augusta
charter
great_degree
adverse
rules
adventurers
attend_council
size
hay
mother
censure
surely
evidently
wish_remain
considers
plant
pending
meet_approbation
harm
best_calculated
uneasy
belonging_said
returns_made
seldom
recovered
nickajack
third_article
armstrong
introduction
leases
onr
engagement
authorizes
requisitions
recourse
lasting_peace
gaither
april_march
could_obtained
box
albany
unwarrantable
council_met
sir_honor
disturb
pure
sources
john_ross
portion_country
seasons
yazoo
permanent_peace
jealousies
morals
jasper_parrish
intimated
fires
communicated_congress
interruption
quietly
genesee_river
measures_adopted
pretensions
twice
every_reason
eight_ten
induced_believe
kickapoo_tribe
father_listen
captured
tustunnuggee
guides
cr_amount
preserving
inimical
cayugas
bo
peoria
memorandum
import
edward
confine
troup_governor
detention
mingoes
lime
eligible
restricted
high_shoals
purchase_money
almost_every
inducements
connexions
fulfilled
enjoined
successfully
intermediate
copy_instructions
yielded
observance
wives_children
nineteen
magnitude
stipulated_treaty
colonel_meigs
antoine
cr
assistants
sac
hold_fast
quartermaster_general
thirty_thousand
publication
gentlemen_senate
since_arrival
decisive
judged
hesitation
comforts
grantees
thither
gallons
copies_letters
several_times
improved
opportunities
colonel_gaither
daniel_smith
thought_necessary
assign
expediency
missouri_territory
continent
subscribe
fort_jefferson
explaining
openly
shewn
detachments
forcibly
scarce
enforced
incumbent
gratified
venango
preparatory
threatening
specifying
improve
twelve_hundred
ceremonies
lament
colonels
appointing
marking
jos
killbuck
gordon
perceived
farmer_brother
claiming
session_congress
humbly
postpone
resist
early_period
inconsistent
ore
husbandry
oliver
lbs_tobacco
expecting
moment_received
unprincipled
benjamin_parke
telling
arises
shut
upper_sandusky
arrow
long_ago
inundation
last_spring
tending
blackfeet
recruits
commissioned
hereinafter
forces
dressed
nature_disbursements
general_meriwether
applicable
necessary_measures
gathered
seized
excellency_obedient
accomplishing
esq_secretary
different_parts
thirty_days
hicks
mv
buzzard_roost
taking_care
punishing
bounded_follows
termed
beard
piqua
collection
representing
means_power
strange
tongue
present_system
confess
various_tribes
uchee
amicably
liver
missing
wrongs
owned
slate
sanctioned
offices
wealth
purchasers
incur
oak_marked
letter_written
practices
affecting
ear
wretched
innocence
associated
sale_lands
gratifying
sea
kindly
embarked
april_amount
colonel_walton
enlarged
th_jefferson
w_hite
compere
instructions_given
lieu
vve
ball
smallest
burnett
well_armed
formidable
constant_freeman
executing
stranger
granting
anderson
bury
irwin
contemplation
reflecting
pressure
fort_wilkinson
confide
excursions
give_full
courts
amongst_us
navigable
reservations_made
sixty_miles
stealing
earlier
colonel_mckenney
kettle
pickering
sentence
authorities_georgia
estimation
northerly
parties_desirous
lessen
old_man
reluctance
w_ar
forwarded_superintendent
hasten
jas
cherokees_chickasaws
opposing
knife
bright
country_ceded
aside
utmost_power
vermilion
levi_colbert
impartial
hammock
city_philadelphia
aspect
beat
face_face
acknowledge_receipt
cloud
kegs
resistance
preceding_article
erecting
stronger
arose
confederation
carlisle
late_superintendent
object_mission
dollars_paid
advancing
discontent
hereby_acknowledge
wras
entrance
great_distance
interposed
joseph_marshall
brass
counteract
placed_hands
sergeants
arts_civilized
unanimous
therefor
conclude_treaty
much_less
heirs_assigns
oblige
firmness
surplus
included_within
quarrel
expressing
drawn_treasury
camps
seven_miles
born
aud
southwest_point
examples
captain_hendricks
following_statement
swear
serious_consideration
suggestions
annual_account
grand_river
indulgence
vigorous
chota
charley
every_means
submitting
articles_article
void
holden
services_rendered
overtures
muster
motion
kansas
perpetuate
art_undersigned
mount
chastise
brings
sixth
embodied
officially
exchanging
tract_ceded
apology
improving
take_steps
june_july
due_proportion
hint
secretary_treasury
timely
reverend
inconvenient
severally
november_sir
seminole_indians
ward
dissatisfied
burn
pilot
sibley
trade_carried
peace_happiness
defended
thomas_crowell
hereunto_subscribed
undertaking
fee_simple
chains
signs
hon_secretary
herewith_submitted
doyle
consultation
fly
proves
affection
depended
exactly
delicate
hereinafter_mentioned
detain
mohawks
barbour
severity
ordering
scheme
every_injury
specially
acquiring
troop
merchant
reside_within
witnessed
unreasonable
head_warrior
takes
remonstrance
promoted
extremity
noticed
young_king
day_december
foxes
corresponding
devise
hither
north_bank
north_ohio
paper_marked
mountain_town
whereof
honor_submit
read_explained
four_months
sell_land
december_last
eight_dollars
mankind
folly
considerable_portion
religious
subsequently
correctness
respectful
policy_government
sufferers
sent_forward
uncle
consists
gillivray
idle
narrative
bad_talks
flints
east_florida
leads
elk
spies
new_arrow
agreeing
co
servant_benjamin
much_greater
servant_calhoun
church
sum_money
intent
complaint_made
signing_treaty
mutually
road_leading
every_effort
favors
wicked
salutary
deposite
unacquainted
predecessor
distribute
meigs
tenure
act_passed
solicited
imposition
compliance_resolution
john_johnson
six_years
yellow
bearing_date
withdraw
vide
chickasaw_choctaw
maryland
circular
violate
due_west
wherein
commissioned_officers
kindled
made_acquainted
magistrate
attended_council
enclosure
crisis
sachems_warriors
valley
southwestern
john_coffee
errors
freight
merchandise_forwarded
testify
situations
avert
leader
reduction
unfortunate_people
february_sir
managing
racoon
frontier_settlements
skin
cessions_land
professions
peculiarly
foreign_missions
river_platte
pretext
recapitulation
fifteenth
first_second
dated_knoxville
intimation
general_gibson
regulating
peltries_remaining
changes
fed
comply_request
last_night
medals
hull
fifth_article
hoping
fathers_listen
following_articles
exceeded
withdrawn
commonly
michael
young_fellows
urging
fee
letter_dated
oppression
honor_calhoun
within_knowledge
assertion
implements
scalp
manage
lower_cherokees
scholars
lake_superior
authentic
armies
describe
disinterested
benton
volunteer
public_business
seats
precisely
anthony_wayne
due_notice
freedom
possession_lands
imagine
james_gadsden
merchandise_hand
astor
announced
viz_beginning
disappointment
persevere
learning
concessions
forwarding
consulting
dividing_line
usages
decidedly
joy
seals_done
il
conspicuous
breach
due_respect
highest_respect
nett
hereby_cede
commissioners_holding
silent
respect_obedient
deeds
captivity
limit
misfortune
accord
cash_received
departments
compensate
james_merriwether
recover
calm
contiguous
stage
questioned
patriotism
rash
unavoidable
disclosed
grateful
see_justice
concentration
committing_depredations
teaching
since_period
see_note
legally
ensigns
medal
marching
colonies
daring
ricaras
worst
acquiesce
indisposition
mustered
situate
climate
married
individually
pawnee
know_nothing
cordial
draught
pounds_lead
exchange_territory
losses_sustained
invested
sworn_subscribed
aggregate
principles_justice
tried_found
fora
squaw
silence
persist
rocks
chain_friendship
string
earliest
send_talk
tallow
iu
deal
much_better
hazard
quarter_ending
safely
devoted
articles_merchandise
territory_florida
one_pound
agreeably_instructions
per_receipt
five_years
forgot
led_believe
act_legislature
cox
appropriation_made
ineffectual
resulting
bird
adjutant_general
set_forth
low_grounds
treaty_muskingum
walk
ing
ten_twelve
enmity
inch
emigrating
necessary_arrangements
northwestern
guarded
jno
european
justification
adherents
calcareous
section_country
adjournment
visiting
dangers
farmers
rut
major_chaires
cayuga
heckewelder
tome
constituted
galphinton
line_established
private_revenge
expired
winnebago
mixed
misfortunes
credited
unquestionably
participate
rapids_miami
depth
founded_upon
transporting
continual
kirkland
day_january
lieut
new_agents
british_officers
w_hen
fort_recovery
within_boundaries
twelve_months
visit_president
west_line
names_affixed
z
much_longer
nature_case
treaties_held
dismissed
agricultural
baker
emigrated
frenchman
grade
loways
deception
