indians
may
would
people
united_states
shall
nation
us
one
peace
time
creeks
war
said
country
sent
letter
treaty
chiefs
towns
great
two
hope
give
made
men
commissioners
talk
states
well
place
every
part
must
cherokees
killed
received
state
come
much
wish
good
present
know
could
upon
done
send
general
party
friends
go
see
also
say
order
congress
make
town
indian
informed
man
talks
lands
day
brothers
information
business
white_people
taken
without
land
governor
answer
since
think
way
take
given
many
meet
number
therefore
instant
georgia
river
three
lie
first
return
yet
heard
among
power
frontiers
told
long
might
came
sir
arrived
hear
last
letters
horses
warriors
soon
honor
meeting
several
necessary
far
find
going
house
frontier
excellency
near
little
cumberland
white
opinion
parties
others
creek
matters
inform
nations
cussetahs
line
governor_blount
creek_nation
case
chickasaws
goods
lower_towns
purpose
friend
conduct
immediately
captain
late
determined
never
president
believe
expect
mischief
prevent
militia
government
satisfaction
went
days
desire
receive
brought
mentioned
nothing
orders
still
whole
tell
property
returned
friendship
president_united
council
delivered
brother
thing
enclosed
troops
get
set
left
consequence
justice
whether
john
found
prisoners
friendly
settled
committed
account
right
best
another
gone
expected
service
always
possible
request
bring
james_seagrove
let
colonel
manner
effect
officers
bad
ol
head
upper_creeks
march
cause
horse
want
dated
reason
old
keep
proper
four
act
ought
back
doubt
express
called
remain
spaniards
certain
within
protection
treaties
situation
better
wrote
inhabitants
mary
appear
fort
chief
coming
continue
making
object
force
king
fully
got
person
district
ever
james
appointed
june
instructions
together
live
tennessee
thought
respecting
home
territory
augusta
quarter
terms
towards
considered
agreed
six
report
following
likewise
mean
particular
copy
yesterday
gave
true
ordered
august
public
however
put
met
army
occasion
july
seagrove
till
held
philadelphia
oconee
arrival
able
presents
full
command
father
small
watts
settlements
measures
secretary_war
major
ot
tribes
lately
appears
directed
though
mcgillivray
says
treat
means
november
unless
matter
barnard
hopes
kill
hostilities
happy
agent
miles
state_georgia
affairs
five
fear
attend
duty
new
trade
measure
station
leave
thence
danger
hand
april
persons
perhaps
except
choctaws
like
advice
attended
either
large
took
shawanese
pay
least
county
attention
speak
intended
circumstances
provisions
necessity
ohio
interpreter
heads
post
speech
citizens
one_hundred
already
assistance
articles
obliged
join
different
september
probably
consider
contrary
seen
boundary
upper
hands
future
panton
w
month
upper_towns
even
body
former
oakmulgee
every_thing
proceed
hold
known
appeared
obtain
spanish
suppose
miami
although
disposition
thereof
superintendent
respect
written
road
houses
year
whose
wounded
life
nature
forward
copy_letter
south_carolina
destroy
creek_indians
next
morning
cherokee
path
desirous
generally
whites
secretary
seem
besides
point
october
pleasure
guard
understood
sorry
reasons
consideration
seven
strong
authority
cowetas
claim
influence
call
store
sandusky
safety
demand
eight
southern
supposed
disposed
timothy_barnard
lives
hanging_maw
rest
things
side
indian_affairs
taking
kinnard
parts
kentucky
cornell
ultimo
opportunity
young
north_carolina
lor
blood
ready
arms
company
result
view
desired
requested
none
red_people
giving
knowledge
hunting_grounds
expedition
observe
certainly
enemies
posts
carried
truth
anil
name
whilst
fall
passed
children
expense
son
endeavor
remove
longer
british
notice
proceedings
ten
carry
accompany
corn
proposed
depredations
assured
regard
acquainted
course
south
runners
commissioners_united
department
die
established
promised
understand
mcdonald
make_peace
colerain
william
deliver
forwarded
take_place
belonging
suffer
supplies
attempt
write
rock_landing
possession
greatest
support
minds
citizens_united
end
knoxville
years
young_men
february
indian_nations
particularly
wait
lay
lower_creeks
esq
david_cornell
serve
engaged
addressed
confidence
safe
dollars
general_logan
oft
waters
interest
saw
daily
past
general_robertson
agree
nearly
lower
nashville
mouth
favor
hunting
conference
mind
agreeable
away
sending
stop
open
asked
early
determination
aid
fifty
accounts
yon
impossible
knew
woods
render
savannah
sooner
moment
union
presence
prevented
mad_dog
treated
officer
obtained
pass
event
marked
induce
probable
john_mckee
mountain
please
georgians
third
kind
part_nation
sum
deponent
declared
importance
neither
ground
accordingly
fort_fidius
afraid
white_lieutenant
families
journey
carolina
january
communications
chickasaw
less
papers
plan
b
pursued
defence
kept
run
killing
paid
hurt
foot
promise
actually
injury
w_ill
mckee
obedient_servant
death
desist
lost
concluded
principal
along
friends_brothers
spring
authorized
six_nations
intention
judge
whatever
sufficient
friend_brother
liberty
john_galphin
confirmed
thirty
glad
law
trouble
assist
j
assure
ami
expressed
look
lias
seemed
herewith
require
discovered
purchase
general_washington
mississippi
attack
need
latter
family
seems
provided
favorable
traders
direct
numbers
degree
immediate
protect
happiness
gentlemen
niagara
idea
e
chehaws
galphin
new_york
afford
fired
father_president
red
care
cherokee_nation
mero_district
infantry
writing
seeing
causes
pleased
fort_erie
peaceable
rather
convinced
lieutenant
women_children
learn
agreeably
wishes
laid
virginia
distance
contained
robbed
raised
creeks_cherokees
direction
paper
settle
arc
bearer
quiet
nine
continued
stores
honorable
major_general
receiving
major_gaither
andrew_pickens
pittsburg
short
innocent
washington
places
twenty
granted
message
second
hostile
loss
due
north
white_man
money
murderers
maw
take_satisfaction
wished
relative
objects
extract_letter
become
often
entered
general_wayne
cut
water
invasion
supply
heretofore
savages
fellow
evening
dead
observed
highly
assembled
flint_river
hath
warrior
refused
considerable
times
americans
mention
burges
murder
injuries
west
form
purposes
negro
appearance
thomas
establish
formed
hut
high
address
shortly
concerned
unfortunate
murders
office
utmost
security
within_limits
major_seagrove
character
perfectly
owing
almost
twelve
real
destruction
appointment
stay
delay
repeated
grant
period
great_britain
dear_sir
enemy
reply
consent
america
scalps
camp
allowed
turn
ii
principles
cross
night
previous
acquaint
northern
read
settlement
boundaries
governor_telfair
follows
induced
whole_nation
alarmed
young_warriors
advise
ask
five_hundred
sure
thousand
hearing
wish_peace
put_stop
pensacola
feel
th
additional
respective
provision
tne
iny
serious
mad
big
joined
words
transmitted
claims
heart
proceeded
greater
article
deputies
laws
blame
powerful
used
destroyed
cavalry
agents
question
indeed
give_satisfaction
commission
western_indians
general_knox
indian_tribes
satisfactory
clear
received_letter
truly
policy
opened
honor_sir
supplied
difficulty
committee
half
move
december
spoke
representation
explain
sentiments
behalf
according
plundered
addition
affair
seneca
governor_simcoe
villains
prospect
thus
interpreters
arrive
visit
date
removed
essential
beloved
next_day
expenses
w_ith
commissioner
fixed
chiefs_warriors
notwithstanding
deputation
invitation
instead
required
copies
winter
equal
intentions
murdered
trust
draw
demanded
let_know
acting
answered
knox
discover
beloved_men
limits
captain_brandt
communicated
months
firm
fell
trader_hill
hopewell
admit
without_delay
signed
cattle
otherwise
great_father
add
lead
soon_possible
keep_peace
satisfied
governor_georgia
communication
tuckaubatchees
try
lower_cherokee
consequences
treaty_held
knowing
prisoner
negroes
general_government
light
extract
comes
despatch
nave
endeavored
federal_troops
intelligence
enter
effected
runner
enough
october_sir
florida
forty
alone
convenient
something
summer
measures_taken
founded
rights
furnished
happened
work
punish
quantity
proclamation
go_war
reason_believe
bear
explained
common
upwards
endeavors
advanced
listen
finding
northward
advised
frontiers_georgia
little_turkey
southward
repeat
townsend
two_thousand
war_department
pursue
news
alexander_cornell
private
volunteers
companies
proof
invited
lived
leaving
savage
stated
ill
detroit
stand
possess
wanted
change
john_watts
george
mistake
fork
follow
great_deal
settling
despatches
bad_men
ago
declare
chickasaws_choctaws
happen
success
guilty
acknowledged
told_us
stopped
oppose
amount
horsemen
david
gun
undoubtedly
deputy
suffered
intend
neighborhood
reported
certainty
choctaw_nation
village
guns
western
ever_since
properly
reports
exertions
mine
excellency_governor
strongly
one_thousand
offered
secure
drawn
two_hundred
thirteen
recommend
running_water
beloved_man
continuance
encroachments
tor
disputes
permission
viz
restored
sincere
gives
drive
minutes
ammunition
followed
lose
punishment
hundred
collected
reside
distant
alexander
commanding_officer
tribe
cession
ceded
state_north
compelled
easily
permit
departure
directly
settle_matters
pleasing
mischief_done
front
treaty_fort
richard
belt
informing
oil
particulars
offenders
turned
honest
gaither
communicate
per
confirm
eyes
fail
glass
advantage
outrage
engage
clothing
amongst
executive
major_craig
living
effectual
entirely
enclose
exposed
duplicate
last_month
step
interpreted
conceived
despatched
promises
acts
shaw
employed
well_known
expedient
carrying
relief
english
arrangements
vessel
recent
frontier_inhabitants
coining
acknowledge
invade
major_ore
negotiations
joseph
morris
beyond
wilson
northern_tribes
benjamin_hawkins
establishment
conclude
richard_winn
henry
relations
fellows
fact
afterwards
waited
difficulties
issued
colonel_mckee
carey
punished
humanity
transmit
choose
fair
peace_friendship
seven_hundred
holston
w_hich
compensation
bad_talks
inquire
trace
free
propose
prove
commit
northern_indians
personal
trader
procure
settlers
days_ago
arise
hard
readily
insult
waiting
vain
beg
conceive
boy
offensive
black
love
injured
cussetah
tis
small_parties
violence
white_wampum
furnish
ns
raise
characters
formerly
advance
passing
ere
exert
remember
word
remained
mode
woman
pursuit
upper_lower
knox_secretary
difficult
especially
major_henry
lasting_peace
perfect
crossing
ihe
equally
rations
close
sides
doings
indispensable
proceeding
farther
june_sir
honor_governor
v
instructed
therein
hereby
establishing
lying
altogether
outrages
hostile_indians
spirit
believed
chehaw
extended
tour
chickasaw_nation
charged
ruin
conveyance
state_house
sold
side_river
enable
thompson
north_side
legion
bloody_fellow
took_place
acted
enclosed_copy
attacked
sensible
middle
general_pickens
frontier_georgia
letter_colonel
assurances
majority
hostages
detained
disagreeable
complied
thereby
convince
women
french_broad
similar
east
powers
described
charles
appoint
commanding
sixty
burnt
execution
august_sir
list
straight
approbation
sense
transactions
effects
submitted
six_miles
rivers
look_upon
lower_cherokees
completed
two_days
motives
concerning
complaints
remains
trail
hostility
military
poor
general_twiggs
horses_stolen
services
reasonable
forty_miles
respectable
tired
opening
quarters
beginning
vour
u
route
wants
principle
hearts
thereto
session
save
short_time
garrison
treating
wc
restrain
murders_committed
oakfuskees
weeks
willing
show
interview
unknown
injure
harmar
sevier
turkey
threatened
makes
worse
take_measures
commissioners_appointed
stolen
lest
boundary_line
art
anxious
bounds
allow
alarm
belong
persuaded
dangerous
mcintosh
brown
southwest_point
crossed_oconee
complete
prepared
statement
pointed
lies
court
spain
highest
f
opposed
servant
sin
rendezvous
informs
wise
benefit
wrong
preceding
propriety
reached
determine
w_ho
information_received
whence
sincerity
health
reward
arms_ammunition
great_council
great_spirit
extend
superintendent_indian
steps
getting
smith
brigadier_general
sign
damage
threats
instance
violent
shall_expect
liberal
marched
dispute
violation
oconee_river
submit
robert
resident
fleming
dear
mark
wall
ford
events
circumstance
critical
pray
entering
enclosures
views
nevertheless
judgment
united
probability
readiness
raising
demands
term
skins
hardly
towards_united
cumberland_river
live_peace
major_beard
map
directions
evidence
running
esquire
horrid
sell
system
edward_telfair
consisting
robertson
commandant
subjects
field
sworn
long_since
national
meaning
world
hatchet
experienced
conducted
permitted
esteem
six_hundred
numerous
strict
let_us
valuable
comply
go_home
would_appear
collect
keeping
conditions
ears
conversation
joseph_martin
aforesaid
shew
enclose_copy
r
galphinton
july_sir
consult
fast
prospects
usual
declaration
murdering
l
wampum
apprehend
break
neighboring
retaliation
charge
telfair
submitted_president
george_galphin
adopted
stealing_horses
hence
navy_hall
accompanied
wayne
endeavoring
returning
wyandot
greatly
estanaula
unprovoked
every_matter
good_talks
execute
stock
resolved
avoid
hereafter
exclusive
faith
alter
unnecessary
value
old_line
foregoing
accept
names
contents
general_sevier
provide
board
speaks
hitherto
fit
districts
continuing
two_parties
payment
privates
wanting
regular
hunt
w_hite
buzzard_roost
doctor
annual
exceeding
application
likely
generals
calling
legislature
movements
perpetrators
complaint
important
begin
river_ohio
blount
abilities
would_probably
honor_enclose
recently
considering
condition
intercourse
interests
frequently
delayed
shoulderbone
remainder
resolution
seriously
martin
mean_time
distressed
temporary
counties
head_men
round
tlie
agent_indian
firmly
taken_place
added
think_proper
bv
language
requesting
began
large_party
abide
tins
depend
letter_major
answers
paths
shot
commanded
opposition
oath
stations
restore
time_past
cussetah_king
expresses
strictly
mile
offer
footing
mouth_detroit
moon
lines
mobile
fifteen
paying
holding_treaty
plans
secretary_smith
claimed
hon
killed_scalped
mr
congress_assembled
total
strike
depredations_committed
commence
useful
holmes
strings
washington_district
since_writing
accomplish
mordecai
beg_leave
captain_john
augusta_september
concessions
absence
represent
share
search
evil
adopt
justice_done
come_forward
yards
unexpected
placed
ten_days
thinks
craig
boats
extremely
boat
eighteen
n
talked
extreme
sir_enclosed
principal_chiefs
salt
constantly
facts
mounted_infantry
pains
clinch
thereon
colonel_melton
nickajack
sea
scalped
miles_place
know_whether
colbert
estimated
fix
steal
great_chief
assigned
enclosing
design
setting
containing
drink
injustice
foundation
help
aiken
air
regular_troops
shed
westward
faithful
refer
ease
dated_knoxville
toward
april_sir
obstinate
requisite
principally
beard
friendly_towns
proved
executed
accident
senate
bushels
eighty
defensive
grievances
referred
improper
led
beads
hunters
bledsoe
caused
plainly
certify
secret
throw
invading
deemed
proofs
repair
mounted
sick
bodies
put_death
involve
whenever
saying
using
preserve
forts
urged
soldiers
range
line_run
virginians
whiskey
thousand_dollars
natchez
really
steps_taken
district_mero
camps
negotiation
produced
william_blount
take_hand
clair
bloody
forth
general_clarke
rob
coody
handed
spot
henderson
irwin
afforded
homes
regret
ran
blow
fresh
speeches
customs
inquiry
justice_humanity
expeditions
approach
plunder
redress
concern
accommodation
individuals
inform_excellency
consist
mission
humble_servant
glad_hear
detachment
behalf_united
confederacy
meant
appearances
reach
earliest
knoxville_april
season
resolves_congress
calculated
citizen
opposite
supported
agreed_upon
yet_come
stealing
imagine
extracts
apply
ana
entire
square
heavy
unite
injuries_done
treasury
declaring
cost
sight
preserve_peace
returned_home
wabash
regiment
renew
broke
suspect
southern_tribes
crossed
tools
satisfy
promote
knows
attending
cumberland_settlements
distinction
possibly
affords
apprehensive
several_letters
w_e
existing
cover
saturday
escort
respectively
bird
resolve
urge
quit
proposed_treaty
take_care
breaking
mutual
hoped
sergeant
eat
samuel
leading
four_days
resentment
revenge
mentioning
well_pleased
risk
hold_fast
remark
escape
visited
apprehensions
restrained
suitable
charves
general_chapin
bold
impressed
expectation
hold_treaty
breath
respected
hill
executive_state
intended_invasion
recollect
speedily
ascertain
parrish
actual
issue
across
including
forbid
countrymen
preparations
flag
observance
explicitly
contain
acquaintance
duties
dread
permanent
price
wife
freely
operation
drove
alarming
junction
heads_upper
moved
distress
discharged
arrangement
assembly
fourteen
deep
cumberland_settlers
franklin
visit_president
jealousy
mounted_volunteers
may_depend
holding
extent
arid
countries
tobacco
island
opinions
designs
june_last
herein
september_sir
best_friends
full_satisfaction
captain_hendricks
putting
commander
northward_indians
wabash_indians
decided
return_home
preservation
unfriendly
surprised
villages
goes
anti
complain
three_days
constitution
attend_treaty
invaded
establishment_peace
start
corps
door
avoided
three_four
lands_within
individual
williamson
replied
expectations
weatherford
reserved
situated
pennsylvania
feelings
continually
brigade
wisdom
train
st
interference
district_washington
fort_jefferson
united_slates
protest
considerations
present_yesterday
servants
deceived
exist
last_evening
lands_ceded
advisable
difference
prudent
refuse
resided
several_times
relinquish
child
encouraged
glynn
think_necessary
young_fellows
twenty_miles
speedy
represented
dear_friend
operations
exceed
deposition
committing
dons
pacific
easy
explicit
worth
rash
attachment
telling
discharge
source
hail
comprehend
fate
practicable
punishing
fifteen_hundred
steal_horses
sitting
john_fleming
influential
great_respect
captain_freeman
sufficiently
soil
greene
escaped
mountains
fort_washington
arm
davidson
intercept
sincerely
head_warrior
week
driven
previously
several_parties
scarcely
tranquillity
dispositions
taylor
mill
adair
conferences
game
unanimously
federal
faithfully
pity
spare
monday
gentleman
supposing
greene_county
block_house
whole_upper
thirty_miles
enabled
invite
delawares
oi
justly
received_express
delivery
inclined
altamaha
honor_writing
rash_steps
sufferings
contractor
genesee
forgot
tract
quite
presume
addressing
ordering
said_deputies
adams
thank
chippewas
face
edward
rapids
eventually
jasper_parrish
chiefly
federal_government
consented
desirable
sit
embark
beneficial
languages
henry_gaither
fort_matthews
constant_freeman
general_lincoln
pigeon
neighbors
blessings
disappointed
attached
clothes
invoice
involved
incurred
colonel_alexander
agreement
james_carey
messengers
wit
repeatedly
lawless
speaker
insisted
randolph
december_sir
called_service
folly
tongue
permanent_peace
restoring
colonel_martin
judge_proper
standing
good_understanding
veracity
two_years
colonel_winchester
tracts
major_king
present_situation
orleans
transportation
tellico_block
scolacutta
eastward
ins
conclusion
relatively
campbell
tells
northwards
great_pleasure
war_office
removing
kindness
consequences_would
ac
timely
shelby
september_next
unauthorized
travellers
representations
hat
purchasing
forever
behind
march_last
daniel_smith
timothy_pickering
obtaining
encamped
expecting
southwest
order_government
bounty
agent_north
fine
maybe
extensive
continental
h
hamilton
list_murders
cleared
tiie
sixteen
clarksville
thought_proper
united_stales
intended_expedition
inclination
belonged
ascertained
mountain_leader
vicinity
three_thousand
regardless
successful
pounds
differences
cussetah_town
unfortunately
dare
well_acquainted
earnest
good_intentions
person_persons
flatter
active
make_known
commit_hostilities
ash
every_means
adequate
distinguish
ones
rifles
sundry
nephew
useless
respects
confident
mother
messenger
forced
ann_gray
severely
looked
scalp
place_called
thought_best
bloodshed
anxiously
river_mary
finished
ten_miles
cease
tend
draught
grounds
doubtless
naked
geo
bought
depended
southern_department
check
never_heard
prevail
alexander_mcgillivray
sovereignty
uneasy
mustered
yes
messages
tallassee_king
bis
solemn
since_left
stocks
scouts
armed
payne
bluff
room
disturb
real_friend
preparation
low
started
moderation
side_oconee
forming
days_past
commands
treatment
willbanks
bringing
last_summer
may_require
understanding
enclosure
peaceful
habersham
governor_neal
deserve
next_morning
time_ago
unhappy
connexion
hours
alex
preference
requisition
injury_done
enjoy
mere
piece
questions
senecas
died
rendered
daniel_moffit
reason_think
dick
friday
fled
knife
treaties_fort
demand_satisfaction
expressly
mathews
rum
taken_files
pretend
divided
admitted
trading
insist
conduct_towards
last_year
seagroye
long_island
finally
make_doubt
honor_henry
matters_settled
around
quarrel
hopewell_keowee
brethren
confer
detention
obedient_humble
miamies
justices
verily_believe
murder_robbery
copy_original
pugh
presented
punish_bad
exact
wind
stolen_horses
tow_ns
choctaws_chickasaws
attempts
temper
alive
branch
ould
fight
adhere
mv
deal
prudence
teach
resides
inimical
human
uncertain
delaware
harrison
lodged
wherein
favored
stole
american
neglect
base
fora
examination
needful
detain
refuge
marks
secured
arrow
sat
original
four_months
kentucky_road
pipe
came_hand
sunday
positive
compared
frequent
indian_trade
wishing
basis
simcoe
ensure
fallen
applied
least_doubt
south_ohio
next_month
restore_peace
efforts
reputation
principal_men
conviction
humane
unavoidable
ideas
whitfield
preparing
excellency_obedient
mohawk
governed
january_sir
bank
headmen
relinquishment
erected
contract
upwards_two
last_night
troop
forwarding
deponent_saith
indian_runners
coweta
seven_miles
bad_conduct
judged
knoxville_march
exchange
british_government
due_respect
nights
upton
existed
ability
may_rely
cumberland_kentucky
voice
bowles
confirmation
recourse
hasty
positively
method
fully_convinced
assembled_rapids
sale
credit
commenced
uncle
could_get
mingoes
jefferson
abuse
invitation_president
go_philadelphia
official
instantly
large_sum
imposed
mistaken
anthony
saith
warrior_king
scout
ou
denied
twelve_miles
confined
made_known
setilla
fortune
avith
dated_mary
note
seek
albany
afternoon
honors
gillivray
northwest_ohio
four_five
march_sir
large_body
letter_ultimo
moving
runs
dollars_per
exerted
treaty_holston
effectually
dollar
injurious
cherokee_towns
forbear
fully_informed
camden
wm_blount
detaining
ensign
rapids_miami
spanish_agent
james_aiken
garrisons
experience
honorable_body
send_express
spoken
colonel_butler
declined
track
spies
returning_peace
desperate
stole_horses
knoxville_june
contribute
tim
headed
ore
four_hundred
conveyed
wilkinson
regularly
preliminary
aggressors
daniel
possessed
truce
store_robert
captivity
missing
lord
urquhart
alluded
assembling
assisted
token_friendship
crossed_river
thieves
ar
honored
offence
principal_chief
sutler
justified
british_agents
sanguine
ail
reduced
occasions
exchange_prisoners
defenceless
four_miles
convention
seminole
unwarrantable
embrace
humbly
fourth
relating
enterprise
compliance
kings
able_judge
february_sir
jefferson_county
thefts
joining
pressed
disorderly
personally_appeared
overall
salary
near_mouth
ridge
evans
attempting
destroying
logan
example
trading_post
strongest
independent
creeks_passing
purchased
respect_sir
connexions
father_general
delivering
miller
equal_number
duly_sworn
fire
new_boundary
portion
recovery
tennessee_county
sincerely_wish
clock
owners
woodward
full_council
eye
rank
receipt
passes
killing_white
company_mounted
visit_philadelphia
cane
seventy
remember_talks
carefully
duck_river
manners
rascals
information_respecting
mountain_town
carr_bluff
stipulations
inviting
journal
ilolston
ave
breed
led_believe
assurance
november_last
contemplated
wanton
overtures
experiment
said_superintendents
quantities
years_ago
tellico
vengeance
wagon
ample
capable
fires
licence
militia_service
executive_attest
gaither_secretary
desiring
stand_need
quietly
juncture
gain
desires
strength
explanation
prior
warlike
south_side
keowee
grants
viewed
handsome
hath_taken
ques
quarrels
laying
shawanese_ambassadors
lakes
five_miles
shall_strike
belief
regulated
named
recommended
restoration
points
receipt_letter
propositions
sometimes
decisive
liar
temporary_agent
lieutenant_colonel
stationed
troubles
pretence
leaves
necessaries
requires
keep_path
crime
kindly
taking_care
w_hen
distressing
reliance
sergeants
trying
proposal
sent_oft
separate
returns
chippewa
perceive
cornplanter
sustained
renewed
repel
wyandots_delawares
quick_possible
highly_probable
trusty
duly
treaty_entered
increase
speed
appearing
forget
last_fall
made_escape
angry
hunting_ground
effort
impartial
thanks
concerns
mingo
tallassee
mercy
usechees
robbing
plantation
buffalo_creek
imprudent
overtaken
oakfuskee
occasioned
served
ustinaire
gives_us
moons
takes_place
pickering
confusion
daring
sylvester_ash
listening
turned_back
swords
residence
old_villain
upper_canada
take_steps
found_necessary
large_bodies
labor
robbery
zeal
colors
amongst_us
strive
undertake
double
glad_see
imminent
protection_frontiers
interested
related
single
seminoles
actions
flame
defend
munsees
still_continue
regulations
class
hi
sun
suggest
garvin
conformity
procured
prevailed
felt
color
captain_elliot
suspension
caution
council_fire
cases
fears
special
northwestern_tribes
apprehended
earnestly
surrounded
consulted
tow
stand_arms
chastisement
niagara_july
perform
deer
beverley_randolph
gangs
driving
lo
recover
severe
neglected
cheerfully
wicked
crosses
representatives
leading_men
till_hear
call_service
built
doubts
natural
govern
consistent
indebted
benjamin_lincoln
canandaigua
practice
talking
persist
twice
jones
scene
worthy
pain
head_waters
ottawas
persisted
encourage
ine
pair
feared
duration
joseph_cornell
miami_rapids
singular
wras
smoke
thought_expedient
legislative
late_murders
obedient
spared
pursuing
captain_handley
decide
thing_happened
string_beads
unfavorable
description
effective
quantity_goods
dispose
age
mostly
fathers
crimes
proposed_exchange
detached
fifteen_days
oswego
progress
letting
well_armed
believing
foreign
agrees
scouting
unfortunate_affair
arthur_goody
wherever
files
continues
considers
daughter
deed
evils
chattooga
governors
rains
connected
elder
behavior
satisfaction_injuries
furs
hid
henry_station
foolish
consisted
professions
suspicion
tender
isaac
councils
choice
begging
prejudices
impunity
mohawks
communicated_senate
large_army
js
commissaries
offering
magazines
ult
expired
commonly
humble
apprehension
struck
disgraceful
ranging
surprise
whitley
buford
fowler
evacuated
armed_men
subscribed
vou
falsehoods
action
amicably
revolution
meetings
doyle
habits
buried
exasperated
main
speaking
either_side
various
il
flesh
examples
prejudice
delaware_shawanese
tuckaubatchee
scalping
jack
absolutely
loaded
james_scagrove
passed_tennessee
utterly
remaining
stokes
province
balls
population
north_bank
master
detroit_river
hunter
ahead
namely
postponed
lbs
castleman
commissioned_officers
closely
goodness
captain_bunbury
bill
hair_horses
chota
recovered
discretion
equivalent
string_white
oakinulgee
directing
variety
tuesday
dismissed
build
issue_proclamation
decision
early_possible
depends
tear
k
retreat
allen
ordered_service
warrior_says
tiling
humble_servants
travelling
native
murders_depredations
osborne
writes
restraining
captains
anew
owe
postponing
blood_spilt
lasting
seventeen
city
sent_word
conjunction
landing
estimate
lake_erie
bound
violations
hawkins
publicly
becomes
expressing
venture
colonel_christie
dictated
tassel
partly
pledged
excuse
protected
full_powers
rangers
james_allen
northwest
cattle_horses
firing
harris
girl
sir_since
concealed
weight
exercise
measures_adopted
sir_honor
administration
apprised
defeat
muscle_shoals
thursday
c
plenipotentiary
canoes
travel
correspondence
eleventh
prompt
fifth
ten_dollars
colonel_gaither
ever_saw
hills
wives
dickinson
preserved
robberies
rear
wagons
listen_talks
conceives
whereas
hutchinson
different_parts
knew_nothing
roberts
w_ish
accompanying
jacob
farthest
red_children
bryant
welfare
sedgwick
wear
hostilities_cease
passion
deny
acceptable
complying
human_blood
confederation
accomplished
buy
furnishing
fifty_miles
wyandots
witness
supplying
clarke
assemble
prince
foot_rapids
contemplation
trial
turning
voice_whole
madrid
moderate
facilitate
mentions
saving
purport
leading_chiefs
complained
glaize
quartermaster_general
sudden
guarded
overtook
proprietors
western_territory
parties_going
solid
excited
declarations
colonel_brown
exists
ninety
reconcile
thrown
requiring
dignity
apparent
else
w_hat
respectfully
frontier_settlers
boys
leads
broken
painful
officers_privates
generous
division
terminate
cowetas_broken
conspicuous
legislative_rights
breast
final_answer
jns_yes
fully_explain
excepted
grand_glaize
situation_affairs
captain_randolph
enclosed_copies
southwestern_territory
ignorant
chain_friendship
within_thirty
defray
inevitable
obedience
hereunto
rode
girty
distributed
contest
jas
fort_harmar
villanous
pickens
grantees
leader
ashamed
blacksmith
cultivation
piamingo
canada
disputed
forcibly
pattawatamies
extinguished
negotiate
contention
sacred
omitted
valley
stating
floridas
oblige
ordinance
winnsborough
colonies
prepare
sterling
error
journals
cousin
warm
residing
medal
falls
virtue
serving
begun
muskingum
linguister
balance
annexed
northeast
knoxville_november
examined
dinsmoor
rose
llolston
subsist
latitude
haste
ancient
hendricks
hears
capital
convey
silver
retain
avayne
conveyances
bones
sail
honor_transmit
stanwix
totally
disregard
beat
sovereign
ottawa
embarked
jos
sachems
sums
members
violated
ordained
adjoining
occurrences
widow
greenville
inferior
presumption
stream
retained
chose
strange
accustomed
depend_upon
falling
iron
instances
silence
wo
changed
hint
backward
lire
indulged
obstacle
tree
starving
despair
consequently
dreaded
cautious
gathered
therefrom
secretary_jvar
obligations
fast_hand
requests
reception
superior
asking
grow
complexion
vigilance
aware
partial
sullivan
preparatory
constant
lit
brother_david
evidently
substance
adjust
undoubted
liver
seat
fortunate
pieces
artillery
band
insolent
enclosed_extract
shown
lather
investigation
pacify
unprepared
disturbance
stood
muster
hole
roost
false
spoiled
fault
tugelo
pack
bright
capacity
roads
disappointment
disturbed
entertained
transported
responsible
spaniard
declares
corporals
sometime
justify
dragoons
pistols
vested
sue
lady
pursuance
hither
banditti
offices
learned
schooner
deter
delegates
remedy
pages
sm
unjust
shipped
losing
ninth
commencement
alternative
race
interfere
eighth
aikens
powder
material
burn
companions
seagrove_agent
regulate
gratitude
disapprobation
preventing
excepting
silent
european
predatory
grand
er
pound
retire
employ
invested
plundering
marching
swamp
impression
capt
necessarily
deliberate
warfare
convened
exhausted
days_date
cruelty
species
stands
smallest
impress
entitled
hour
walnut
informant
binding
ignorance
hanging
ofthe
relation
judging
overset
dictate
ensuing
rightly
bore
hiwasee
defined
fairly
accede
enforce
masters
diminished
heaton
record
score
space
acres
esquires
serv
arthur
violate
god
oppression
unanimous
guarantied
stopping
canoe
french
villany
counteract
robertson_dated
tin
obvious
fools
civil
approaching
greensborough
impracticable
macklin
proposition
surely
borne
content
cany
dean
drawing
lieut
melton
dissatisfied
wrongs
busy
farms
borders
bow
banks
describe
absolute
ball
cliota
alabama
justifiable
unacata
walker
assistant
observations
avill
grove
attest
francis
eighteenth
adding
green
length
ohio_boundary
prosperity
tire
attest_urquhart
interesting
territories
hundred_miles
wide
jvar
intelligent
stipulate
amity
compel
reflect
clearly
club
brings
designing
van
enclosed_extracts
sacrifice
si
arrange
mutually
williamsburg
personally
captured
arisen
included
gets
relieve
complaining
collecting
tried
avail
eligible
remembrance
pretext
plenty
accommodate
volunteer
armies
corner
abandoned
attribute
rely
rejoice
effecting
allies
retaken
burned
hundred_cavalry
hundred_infantry
proportions
tom
merely
insolence
indirectly
foresee
entertain
relied
lam
tendency
strengthen
bay
